{
  "key": [
    [
      {
        "title": "Anticipatory smiling: linking early affective communicataion and social outcome",
        "author": "Parlade, M. V. and Messinger, D. S. and Delgado, C. E. F. and Kaiser, M. Y. and Van Hecke, A. V. and Mundy, P. C.",
        "conference": "Infant Behav. Dev.",
        "year": "2009"
      }
    ],
    [
      {
        "title": "What does that smile mean? The meaning of nonverbal behaviors in social interaction",
        "author": "Rashotte, L. S.",
        "conference": "Soc. Psychol. Q.",
        "year": "2002"
      }
    ],
    [
      {
        "title": "Nonverbal behaviors and social evaluation",
        "author": "Shrout, P. E. and Fiske, D. W.",
        "conference": "J. Pers",
        "year": "1981"
      }
    ],
    [
      {
        "title": "What is in a smile?",
        "author": "Messinger, D. S. and Fogel, A. and Dickson, K. L.",
        "conference": "Dev. Psychol.",
        "year": "1999"
      }
    ],
    [
      {
        "title": "The ontogenesis of smiling and laughter: a perspective on the organization of development in infancy",
        "author": "Sroufe, L. A. and Waters, E.",
        "conference": "Psychol. Rev.",
        "year": "1976"
      }
    ],
    [
      {
        "title": "Behavioral markers and recognizability of the smile of enjoyment",
        "author": "Frank, M. G. and Ekman, P. and Friesen, W. V.",
        "conference": "J. Pers. Soc. Psychol.",
        "year": "1993"
      }
    ],
    [
      {
        "title": "All smiles are positive, but some smiles are more positive than others",
        "author": "Messinger, D. S. and Fogel, A. and Dickson, K. L.",
        "conference": "Dev. Psychol.",
        "year": "2001"
      }
    ],
    [
      {
        "title": "Brief report: the smiles of a child with autism spectrum disorder during an animal-assisted activity may facilitate social positive behaviors - quantitative analysis with smile-detecting interface",
        "author": "Funahashi, A. and Gruebler, A. and Aoki, T, and Kadone, H, and Suzuki, K.",
        "conference": "J. Autism Dev. Disord.",
        "year": "2014"
      }
    ],
    [
      {
        "title": "A feasibility study of autism behavioral barkers in spontaneous facial, visual, and hand movement response data",
        "author": "Samad, M. D. and Diawara, N. and Bobzien, J. L. and Harrington, J. W. and Witherow, M. A. and Iftekharuddin, K. M",
        "conference": "IEEE Trans. Neural Syst. Rehabil. Eng",
        "year": "2018"
      }
    ],
    [
      {
        "title": "Using video-based observation research methods in primary care health encounters to evaluate complex interactions",
        "author": "Asan, O. and Montague, E.",
        "conference": "Inform. Prim. Care",
        "year": "2014"
      }
    ],
    [
      {
        "title": "Design of a wearable device for reading positive expressions from facial EMG signals",
        "author": "Gruebler, A. and Suzuki, K.",
        "conference": "IEEE Trans. Affect. Comput",
        "year": "2014"
      }
    ],
    [
      {
        "title": "Positive mood and helping behavior: a test of six hypotheses",
        "author": "Carlson, M. and Charlin, V. and Miller, N.",
        "conference": "J. Pers. Soc. Psychol.",
        "year": "1988"
      }
    ],
    [
      {
        "title": "The effect of smiling on helping behavior: smiling and good Samaritan behavior",
        "author": "Guéguen, N. and De Gail, M.",
        "conference": "Int. J. Phytoremediation",
        "year": "2003"
      }
    ],
    [
      {
        "title": "Positive empathy and prosocial behavior: A neglected link",
        "author": "Telle, N. T. and Pfister, H. R.",
        "conference": "Emot. Rev.",
        "year": "2016"
      }
    ],
    [
      {
        "title": "Varieties of altruism in children and chimpanzees",
        "author": "Warneken, F. and Tomasello, M.",
        "conference": "Trends Cogn. Sci.",
        "year": "2009"
      }
    ],
    [
      {
        "title": "Early development of prosocial behavior: current perspectives",
        "author": "Brownell, C. A.",
        "conference": "Infancy",
        "year": "2013"
      }
    ],
    [
      {
        "title": "A construct divided: prosocial behavior as helping, sharing, and comforting subtypes",
        "author": "Dunfield, K. A.",
        "conference": "Front. Psychol.",
        "year": "2014"
      }
    ],
    [
      {
        "title": "Toddlers' prosocial behavior: from instrumental to empathic to altruistic helping",
        "author": "Svetlova, M. and Nichols, S. R. and Brownell, C.",
        "conference": "Child Dev.",
        "year": "2010"
      }
    ],
    [
      {
        "title": "The sweet smell of... helping: effects of pleasant ambient fragrance on prosocial behavior in shopping malls",
        "author": "Baron, R.A.",
        "conference": "Pers. Soc. Psychol. Bull.",
        "year": "1997"
      }
    ],
    [
      {
        "title": "Weather, mood, and helping behavior: quasi experiments with the sunshine samaritan",
        "author": "Cunnigham, M. R.",
        "conference": "J. Pers. Soc. Psychol.",
        "year": "1979"
      }
    ],
    [
      {
        "title": "The effects of induced emotions on pro-social behaviour",
        "author": "Drouvelis, M. and Grosskopf, B.",
        "conference": "J. Public Econ.",
        "year": "2016"
      }
    ],
    [
      {
        "title": "Feeling and doing: affective influences on interpersonal behavior",
        "author": "Forgas, J. P.",
        "conference": "Psychol. Inq.",
        "year": "2002"
      }
    ],
    [
      {
        "title": "Helping and cooperation in children with autism",
        "author": "Liebal, K. and Colombi, C. and Rogers, S. J. and Warneken, F. and Tomasello, M.",
        "conference": "J. Autism Dev. Disord.",
        "year": "2008"
      }
    ],
    [
      {
        "title": "Empathy and empathy induced prosocial behavior in 6- and 7-year-olds with autism spectrum disorder",
        "author": "Deschamps, P. K. H. and Been, M. and Matthys, W.",
        "conference": "J. Autism Dev. Disord.",
        "year": "2014"
      }
    ],
    [
      {
        "title": "Utilizing social stories to increase prosocial behavior and reduce problem behavior in young children with autism",
        "author": "Wright, L. A. and McCathren, R. B.",
        "conference": "Child Dev. Res.",
        "year": "2012"
      }
    ],
    [
      {
        "title": "Does pet arrival trigger prosocial behaviors in individuals with autism?",
        "author": "Grandgeorge, M. and Tordjman, S. and Lazartigues, A. and Lemonnier, E. and Deleau, M. and Hausberger, M.",
        "conference": "PLoS One",
        "year": "2012"
      }
    ],
    [
      {
        "title": "Evaluating the effectiveness of video instruction on social and communication skills training for children with autism spectrum disorders: a review of the literature",
        "author": "Shukla-Mehta, S. and Miller, T. and Callahan, K. J.",
        "conference": "Focus Autism Other Dev. Disabl.",
        "year": "2010"
      }
    ],
    [
      {
        "title": "Adaptive behavior acquisition of a robot based on affective feedback and improvised teleoperation",
        "author": "Hirokawa, M. and Funahashi, A. and Itoh, Y. and Suzuki, K.",
        "conference": "IEEE Trans. Cogn. Dev. Syst.",
        "year": "2018"
      }
    ],
    [
      {
        "title": "Robot-Assisted Therapy for Learning and Social Interaction of Children with Autism Spectrum Disorder",
        "author": "Bharatharaj, J. and Huang, L. and Mohan, R. and Al-Jumaily, A. and Krägeloh, C.",
        "conference": "Robotics",
        "year": "2017"
      }
    ],
    [
      {
        "title": "The clinical use of robots for individuals with Autism Spectrum Disorders: a critical review",
        "author": "Diehl, J. J. and Schmitt, L. M. and Villano, M. and Crowell, C. R.",
        "conference": "Res. Autism Spectr. Disord.",
        "year": "2012"
      }
    ],
    [
      {
        "title": "How to Implement Robots in Interventions for Children with Autism? A Co-creation Study Involving People with Autism, Parents and Professionals",
        "author": "Huijnen, C. A. G. J. and Lexis, M. A. S. and Jansens, R. and de Witte, L. P.",
        "conference": "J. Autism Dev. Disord.",
        "year": "2017"
      }
    ],
    [
      {
        "title": "Robot-based Intervention Program for autistic children with Humanoid Robot NAO: Initial response in stereotyped behavior",
        "author": "Ismail, L.I. and Shamsudin, S. and Yussof, H. and Hanapiah, F.A. and Zahari, N.I.",
        "conference": "Procedia Eng.",
        "year": "2012"
      }
    ],
    [
      {
        "title": "Children Teach a Care-Receiving Robot to Promote Their Learning: Field Experiments in a Classroom for Vocabulary Learning",
        "author": "Tanaka, F. and Matsuzoe, S.",
        "conference": "J. Human-Robot Interact.",
        "year": "2012"
      }
    ],
    [
      {
        "title": "Evaluating the Child–Robot Interaction of the NAOTherapist Platform in Pediatric Rehabilitation",
        "author": "Pulido, J. C. and González, J. C. and Suárez-Mejías, C. and Bandera, A. and Bustos, P. and Fernández, F.",
        "conference": "Int. J. Soc. Robot.",
        "year": "2017"
      }
    ],
    [
      {
        "title": "Working memory and autism: A review of literature",
        "author": "Kercood, S. and Grskovic, J. A. and Banda, D. and Begeske, J.",
        "conference": "Res. Autism Spectr. Disord.",
        "year": "2014"
      }
    ],
    [
      {
        "title": "Smiles as Multipurpose Social Signals",
        "author": "Martin, J. and Rychlowska, M. and Wood, A. and Niedenthal, P.",
        "conference": "Trends Cogn. Sci.",
        "year": "2017"
      }
    ],
    [
      {
        "title": "Automatic mimicry reactions as related to differences in emotional empathy",
        "author": "Sonnby-Borgström, M.",
        "conference": "Scand. J. Psychol.",
        "year": "2002"
      }
    ],
    [
      {
        "title": "Impaired detection of happy facial expressions in autism",
        "author": "Sato, W.",
        "conference": "Sci. Rep.",
        "year": "2017"
      }
    ],
    [
      {
        "title": "Roles, Strengths and Challenges of Using Robots in Interventions for Children with Autism Spectrum Disorder (ASD)",
        "author": "Huijnen, C. A. G. J. and Lexis, M. A. S. and Jansens, R. and de Witte, L. P.",
        "conference": "J. Autism Dev. Disord.",
        "year": "2018"
      }
    ],
    [
      {
        "title": "Why Robots? A Survey on the Roles and Benefits of Social Robots in the Therapy of Children with Autism",
        "author": "Cabibihan, J. J. and Javed, H. and Ang, M. and Aljunied, M.",
        "conference": "Int. J. Soc. Robot.",
        "year": "2013"
      }
    ],
    [
      {
        "title": "Autism and Social Robotics: A Systematic Review",
        "author": "Pennisi, P. and Tonacci, A. and Tartarisco, G. and Billeci, L. and Ruta, L. and Gangemi, S. and Pioggia, G.",
        "conference": "Autism Res.",
        "year": "2016"
      }
    ],
    [
      {
        "title": "Robot-Mediated Imitation Skill Training for Children With Autism",
        "author": "Zheng, Z. and Young, E. M. and Swanson, A. R. and Weitlauf, A. S. and Warren, Z. E. and Sarkar, N.",
        "conference": "IEEE Trans. Neural. Syst. Rehabil. Eng.",
        "year": "2016"
      }
    ],
    [
      {
        "title": "Interaction with social robots: Improving gaze toward face but not necessarily joint attention in children with autism spectrum disorder",
        "author": "Cao, W. and Song, W. and Zheng, S. and Zhang, G. and Wu, Y. and He, S. and Zhu, H. and Chen, J.",
        "conference": "Front. Psychol.",
        "year": "2019"
      }
    ],
    [
      {
        "title": "Wizard of Oz Studies in HRI: A Systematic Review and New Reporting Guidelines",
        "author": "Riek, L. D.",
        "conference": "J. Human-Robot Interact.",
        "year": "2012"
      }
    ],
    [
      {
        "title": "Small is Insightful: A Method for the Microanalysis of Behaviour and Communication",
        "author": "Griffiths, C. R.",
        "conference": "J. Nurs. Care",
        "year": "2015"
      }
    ],
    [
      {
        "title": "Social Referencing and Children with Autism",
        "author": "DeQuinzio, J. A. and Poulson, C. L. and Townsend, D. B. and Taylor B. A.",
        "conference": "Behav. Anal.",
        "year": "2016"
      }
    ],
    [
      {
        "title": "Single-Case Design, Analysis, and Quality Assessment for Intervention Research",
        "author": "Lobo, M. A. and Moeyaert, M. and Cunha, A. B. and Babik, I.",
        "conference": "J. Neurol. Phys. Ther.",
        "year": "2017"
      }
    ],
    [
      {
        "title": "Robot-Assisted Therapy for Autism Spectrum Disorders with (Partially) Autonomous Control: Challenges and Outlook",
        "author": "Thill, S. and Pop, C. A. and Belpaeme, T. and Ziemke, T. and Vanderborght, B.",
        "conference": "Paladyn, J. Behav. Robot.",
        "year": "2012"
      }
    ],
    [
      {
        "title": "Personalized machine learning for robot perception of affect and engagement in autism therapy",
        "author": "Rudovic, O. and Lee, J. and Dai, M. and Schuller, B. and Picard, R. W.",
        "conference": "Sci. Robot",
        "year": "2018"
      }
    ],
    [
      {
        "title": "Measures of emotion: A review",
        "author": "Mauss, I. B. and Robinson, M. D.",
        "conference": "Cogn Emot.",
        "year": "2009"
      }
    ]
  ]
}